{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<style>.container { width:80% !important; }</style>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "from IPython.core.display import display, HTML\n",
    "display(HTML(\"<style>.container { width:80% !important; }</style>\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Import neo4j DB: 4/?\n",
    "\n",
    "Code to translate v2.7.4_PIS-model.xlsx to neo4j database. "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Setup"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import re\n",
    "import numpy as np\n",
    "import os\n",
    "from IPython.display import Image\n",
    "from IPython.display import display"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Graph, Node, Relationship"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "import helpers"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "from importlib import reload"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Connect to graph via docker-compose link. See http://localhost:7474/browser/"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Graph(host=\"neo4j\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "from pathlib import Path\n",
    "\n",
    "base_path = Path(\"..\")\n",
    "parsed_path = base_path / \"data\" / \"parsed\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "all_species = ['ath', 'osa', 'stu', 'sly']"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Reactions sheet"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Status</th>\n",
       "      <th>AddedBy</th>\n",
       "      <th>ConnID</th>\n",
       "      <th>Species</th>\n",
       "      <th>input1_ID</th>\n",
       "      <th>input1_level</th>\n",
       "      <th>input1_localisation</th>\n",
       "      <th>input1_type</th>\n",
       "      <th>input2_ID</th>\n",
       "      <th>input2_level</th>\n",
       "      <th>...</th>\n",
       "      <th>reaction_type</th>\n",
       "      <th>reaction_id</th>\n",
       "      <th>input1_label</th>\n",
       "      <th>input2_label</th>\n",
       "      <th>input3_label</th>\n",
       "      <th>output1_label</th>\n",
       "      <th>input1_newID</th>\n",
       "      <th>input2_newID</th>\n",
       "      <th>input3_newID</th>\n",
       "      <th>output1_newID</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>forCB</td>\n",
       "      <td>KG</td>\n",
       "      <td>Conn001</td>\n",
       "      <td>ath</td>\n",
       "      <td>L-Met</td>\n",
       "      <td>family</td>\n",
       "      <td>ER</td>\n",
       "      <td>metabolite</td>\n",
       "      <td>SAMS</td>\n",
       "      <td>clade</td>\n",
       "      <td>...</td>\n",
       "      <td>catalysis</td>\n",
       "      <td>rx00001</td>\n",
       "      <td>Metabolite</td>\n",
       "      <td>PlantCoding</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Metabolite</td>\n",
       "      <td>L-Met</td>\n",
       "      <td>SAMS[AT1G02500,AT2G36880,AT3G17390,AT4G01850]</td>\n",
       "      <td>NaN</td>\n",
       "      <td>SAMe</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>forCB</td>\n",
       "      <td>KG</td>\n",
       "      <td>Conn002</td>\n",
       "      <td>ath</td>\n",
       "      <td>SAMe</td>\n",
       "      <td>family</td>\n",
       "      <td>ER</td>\n",
       "      <td>metabolite</td>\n",
       "      <td>ACS</td>\n",
       "      <td>family</td>\n",
       "      <td>...</td>\n",
       "      <td>catalysis</td>\n",
       "      <td>rx00002</td>\n",
       "      <td>Metabolite</td>\n",
       "      <td>PlantCoding</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Metabolite</td>\n",
       "      <td>SAMe</td>\n",
       "      <td>ACS[AT1G01480,AT2G22810,AT3G49700,AT3G61510,AT...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>ACC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>forCB</td>\n",
       "      <td>KG</td>\n",
       "      <td>Conn003</td>\n",
       "      <td>ath</td>\n",
       "      <td>ACC</td>\n",
       "      <td>family</td>\n",
       "      <td>ER</td>\n",
       "      <td>metabolite</td>\n",
       "      <td>ACO</td>\n",
       "      <td>family</td>\n",
       "      <td>...</td>\n",
       "      <td>catalysis</td>\n",
       "      <td>rx00003</td>\n",
       "      <td>Metabolite</td>\n",
       "      <td>PlantCoding</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Metabolite</td>\n",
       "      <td>ACC</td>\n",
       "      <td>ACO[AT1G05010,AT1G12010,AT1G62380,AT1G77330,AT...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>ET</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>forCB</td>\n",
       "      <td>KG</td>\n",
       "      <td>Conn004</td>\n",
       "      <td>ath</td>\n",
       "      <td>Cu2+</td>\n",
       "      <td>family</td>\n",
       "      <td>cytoplasm</td>\n",
       "      <td>metabolite</td>\n",
       "      <td>HMA</td>\n",
       "      <td>family</td>\n",
       "      <td>...</td>\n",
       "      <td>translocation</td>\n",
       "      <td>rx00004</td>\n",
       "      <td>Metabolite</td>\n",
       "      <td>PlantCoding</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Metabolite</td>\n",
       "      <td>Cu2+</td>\n",
       "      <td>HMA[AT1G63440,AT5G44790]</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Cu2+</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>forCB</td>\n",
       "      <td>KG</td>\n",
       "      <td>Conn005</td>\n",
       "      <td>ath</td>\n",
       "      <td>ETR</td>\n",
       "      <td>family</td>\n",
       "      <td>ER</td>\n",
       "      <td>protein</td>\n",
       "      <td>Cu2+</td>\n",
       "      <td>family</td>\n",
       "      <td>...</td>\n",
       "      <td>protein activation</td>\n",
       "      <td>rx00005</td>\n",
       "      <td>PlantCoding</td>\n",
       "      <td>Metabolite</td>\n",
       "      <td>NaN</td>\n",
       "      <td>PlantCoding</td>\n",
       "      <td>ETR[AT1G04310,AT1G66340,AT2G40940,AT3G04580,AT...</td>\n",
       "      <td>Cu2+</td>\n",
       "      <td>NaN</td>\n",
       "      <td>ETR[AT1G04310,AT1G66340,AT2G40940,AT3G04580,AT...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5 rows × 49 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "  Status AddedBy   ConnID Species input1_ID input1_level input1_localisation  \\\n",
       "0  forCB      KG  Conn001     ath     L-Met       family                  ER   \n",
       "1  forCB      KG  Conn002     ath      SAMe       family                  ER   \n",
       "2  forCB      KG  Conn003     ath       ACC       family                  ER   \n",
       "3  forCB      KG  Conn004     ath      Cu2+       family           cytoplasm   \n",
       "4  forCB      KG  Conn005     ath       ETR       family                  ER   \n",
       "\n",
       "  input1_type input2_ID input2_level  ...       reaction_type reaction_id  \\\n",
       "0  metabolite      SAMS        clade  ...           catalysis     rx00001   \n",
       "1  metabolite       ACS       family  ...           catalysis     rx00002   \n",
       "2  metabolite       ACO       family  ...           catalysis     rx00003   \n",
       "3  metabolite       HMA       family  ...       translocation     rx00004   \n",
       "4     protein      Cu2+       family  ...  protein activation     rx00005   \n",
       "\n",
       "  input1_label input2_label input3_label output1_label  \\\n",
       "0   Metabolite  PlantCoding          NaN    Metabolite   \n",
       "1   Metabolite  PlantCoding          NaN    Metabolite   \n",
       "2   Metabolite  PlantCoding          NaN    Metabolite   \n",
       "3   Metabolite  PlantCoding          NaN    Metabolite   \n",
       "4  PlantCoding   Metabolite          NaN   PlantCoding   \n",
       "\n",
       "                                        input1_newID  \\\n",
       "0                                              L-Met   \n",
       "1                                               SAMe   \n",
       "2                                                ACC   \n",
       "3                                               Cu2+   \n",
       "4  ETR[AT1G04310,AT1G66340,AT2G40940,AT3G04580,AT...   \n",
       "\n",
       "                                        input2_newID input3_newID  \\\n",
       "0      SAMS[AT1G02500,AT2G36880,AT3G17390,AT4G01850]          NaN   \n",
       "1  ACS[AT1G01480,AT2G22810,AT3G49700,AT3G61510,AT...          NaN   \n",
       "2  ACO[AT1G05010,AT1G12010,AT1G62380,AT1G77330,AT...          NaN   \n",
       "3                           HMA[AT1G63440,AT5G44790]          NaN   \n",
       "4                                               Cu2+          NaN   \n",
       "\n",
       "                                       output1_newID  \n",
       "0                                               SAMe  \n",
       "1                                                ACC  \n",
       "2                                                 ET  \n",
       "3                                               Cu2+  \n",
       "4  ETR[AT1G04310,AT1G66340,AT2G40940,AT3G04580,AT...  \n",
       "\n",
       "[5 rows x 49 columns]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_edges = pd.read_csv(parsed_path / \"edges-sheet.tsv\", sep=\"\\t\", index_col=0)\n",
    "df_edges.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th>family</th>\n",
       "      <th>reaction_id</th>\n",
       "      <th>members</th>\n",
       "      <th>ath_homologues</th>\n",
       "      <th>stu_homologues</th>\n",
       "      <th>sly_homologues</th>\n",
       "      <th>osa_homologues</th>\n",
       "      <th>functional_cluster_name</th>\n",
       "      <th>labels</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>node_name</th>\n",
       "      <th>level</th>\n",
       "      <th>species</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>AAO</th>\n",
       "      <th>family</th>\n",
       "      <th>ath</th>\n",
       "      <td>AAO</td>\n",
       "      <td>rx00081</td>\n",
       "      <td>AT1G04580,AT2G27150,AT5G20960</td>\n",
       "      <td>AT2G27150,AT5G20960,AT1G04580</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>AAO[AT1G04580,AT2G27150,AT5G20960]</td>\n",
       "      <td>PlantCoding</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>ACH</th>\n",
       "      <th>family</th>\n",
       "      <th>ath</th>\n",
       "      <td>ACH</td>\n",
       "      <td>rx00038</td>\n",
       "      <td>AT2G30720,AT5G48370</td>\n",
       "      <td>AT2G30720,AT5G48370</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>ACH[AT2G30720,AT5G48370]</td>\n",
       "      <td>PlantCoding</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>ACO</th>\n",
       "      <th>family</th>\n",
       "      <th>ath</th>\n",
       "      <td>ACO</td>\n",
       "      <td>rx00003</td>\n",
       "      <td>AT1G05010,AT1G12010,AT1G62380,AT1G77330,AT2G19590</td>\n",
       "      <td>AT1G62380,AT1G12010,AT2G19590,AT1G05010,AT1G77330</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>ACO[AT1G05010,AT1G12010,AT1G62380,AT1G77330,AT...</td>\n",
       "      <td>PlantCoding</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>ACS</th>\n",
       "      <th>family</th>\n",
       "      <th>ath</th>\n",
       "      <td>ACS</td>\n",
       "      <td>rx00002</td>\n",
       "      <td>AT1G01480,AT2G22810,AT3G49700,AT3G61510,AT4G08...</td>\n",
       "      <td>AT4G26200,AT4G11280,AT3G49700,AT3G61510,AT4G37...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>ACS[AT1G01480,AT2G22810,AT3G49700,AT3G61510,AT...</td>\n",
       "      <td>PlantCoding</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>ACS2</th>\n",
       "      <th>node</th>\n",
       "      <th>ath</th>\n",
       "      <td>ACS</td>\n",
       "      <td>rx00248</td>\n",
       "      <td>AT1G01480</td>\n",
       "      <td>AT1G01480</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>ACS2[AT1G01480]</td>\n",
       "      <td>PlantCoding</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                         family reaction_id  \\\n",
       "node_name level  species                      \n",
       "AAO       family ath        AAO     rx00081   \n",
       "ACH       family ath        ACH     rx00038   \n",
       "ACO       family ath        ACO     rx00003   \n",
       "ACS       family ath        ACS     rx00002   \n",
       "ACS2      node   ath        ACS     rx00248   \n",
       "\n",
       "                                                                    members  \\\n",
       "node_name level  species                                                      \n",
       "AAO       family ath                          AT1G04580,AT2G27150,AT5G20960   \n",
       "ACH       family ath                                    AT2G30720,AT5G48370   \n",
       "ACO       family ath      AT1G05010,AT1G12010,AT1G62380,AT1G77330,AT2G19590   \n",
       "ACS       family ath      AT1G01480,AT2G22810,AT3G49700,AT3G61510,AT4G08...   \n",
       "ACS2      node   ath                                              AT1G01480   \n",
       "\n",
       "                                                             ath_homologues  \\\n",
       "node_name level  species                                                      \n",
       "AAO       family ath                          AT2G27150,AT5G20960,AT1G04580   \n",
       "ACH       family ath                                    AT2G30720,AT5G48370   \n",
       "ACO       family ath      AT1G62380,AT1G12010,AT2G19590,AT1G05010,AT1G77330   \n",
       "ACS       family ath      AT4G26200,AT4G11280,AT3G49700,AT3G61510,AT4G37...   \n",
       "ACS2      node   ath                                              AT1G01480   \n",
       "\n",
       "                         stu_homologues  sly_homologues osa_homologues  \\\n",
       "node_name level  species                                                 \n",
       "AAO       family ath                NaN             NaN            NaN   \n",
       "ACH       family ath                NaN             NaN            NaN   \n",
       "ACO       family ath                NaN             NaN            NaN   \n",
       "ACS       family ath                NaN             NaN            NaN   \n",
       "ACS2      node   ath                NaN             NaN            NaN   \n",
       "\n",
       "                                                    functional_cluster_name  \\\n",
       "node_name level  species                                                      \n",
       "AAO       family ath                     AAO[AT1G04580,AT2G27150,AT5G20960]   \n",
       "ACH       family ath                               ACH[AT2G30720,AT5G48370]   \n",
       "ACO       family ath      ACO[AT1G05010,AT1G12010,AT1G62380,AT1G77330,AT...   \n",
       "ACS       family ath      ACS[AT1G01480,AT2G22810,AT3G49700,AT3G61510,AT...   \n",
       "ACS2      node   ath                                        ACS2[AT1G01480]   \n",
       "\n",
       "                               labels  \n",
       "node_name level  species               \n",
       "AAO       family ath      PlantCoding  \n",
       "ACH       family ath      PlantCoding  \n",
       "ACO       family ath      PlantCoding  \n",
       "ACS       family ath      PlantCoding  \n",
       "ACS2      node   ath      PlantCoding  "
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "translate_functional_clusters = pd.read_csv(parsed_path / \"functional_clusters.tsv\", sep=\"\\t\")\n",
    "translate_functional_clusters = translate_functional_clusters.set_index(['node_name', 'level', 'species'])\n",
    "translate_functional_clusters.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "def generate_list(subdf, ids, new_name, homologues=True):\n",
    "    col_suffixes = ['_newID', '_location', '_label', '_form']\n",
    "    new_col_suffixes = ['_name', '_location', '_label', '_form']\n",
    "\n",
    "    if homologues:\n",
    "        col_suffixes += homologue_cols\n",
    "        new_col_suffixes += homologue_cols\n",
    "        \n",
    "    for old_suf, new_suf in zip(col_suffixes, new_col_suffixes):\n",
    "        new_col = new_name + new_suf\n",
    "        old_cols = [id_ + old_suf for id_ in ids]\n",
    "        subdf[new_col] = subdf[old_cols].apply(lambda x: [i for i in x.values], axis=1)\n",
    "        \n",
    "        \n",
    "def rename_target(subdf, id_, new_name, homologues=True):\n",
    "    col_suffixes = ['_newID', '_location', '_label', '_form']\n",
    "    new_col_suffixes = ['_name', '_location', '_label', '_form']\n",
    "\n",
    "    if homologues:\n",
    "        col_suffixes += homologue_cols\n",
    "        new_col_suffixes += homologue_cols\n",
    "\n",
    "    for old_suf, new_suf in zip(col_suffixes, new_col_suffixes):\n",
    "        new_col = new_name + new_suf\n",
    "        old_col = id_ + old_suf\n",
    "        subdf[new_col] = subdf[old_col]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_x_nodes(df, x):\n",
    "    rows_with_x = set()\n",
    "    for i, row in df.iterrows():\n",
    "        for col_prefix in ['input1', 'input2', 'input3', 'output1']:\n",
    "            if row[col_prefix + \"_ID\"] in x:\n",
    "                rows_with_x.add(i)\n",
    "    return rows_with_x"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "def number_input_different(df, homologues=True, catalyst=False):\n",
    "    ''' If catalyst is True, it is the last \"input\" col. '''\n",
    "\n",
    "    if catalyst:\n",
    "        # two inputs, input2 -> catalyst\n",
    "        subdf2 = df[df[\"input3_newID\"].isna()].copy()\n",
    "        generate_list(subdf2, ['input1'], 'substrate', homologues=homologues)\n",
    "        rename_target(subdf2, 'input2', 'catalyst', homologues=homologues)\n",
    "\n",
    "        # three inputs, input3 -> catalyst\n",
    "        subdf3 = df[~df[\"input3_newID\"].isna()].copy()\n",
    "        generate_list(subdf3, ['input1', 'input2'], 'substrate', homologues=homologues)        \n",
    "        rename_target(subdf3, 'input3', 'catalyst', homologues=homologues)\n",
    "        \n",
    "    else:\n",
    "        # two inputs\n",
    "        subdf2 = df[df[\"input3_newID\"].isna()].copy()\n",
    "        generate_list(subdf2, ['input1', 'input2'], 'substrate', homologues=homologues)\n",
    "\n",
    "        # three inputs\n",
    "        subdf3 = df[~df[\"input3_newID\"].isna()].copy()\n",
    "        generate_list(subdf3, ['input1', 'input2', 'input3'], 'substrate', homologues=homologues)\n",
    "    \n",
    "    # combine\n",
    "    new_subdf = subdf2.append(subdf3)\n",
    "    rename_target(new_subdf, 'output1', 'product', homologues=homologues)\n",
    "    \n",
    "    return new_subdf"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "# transcription genes\n",
    "substrate_cols_wo_homologues = ['substrate_name', 'substrate_form', 'substrate_label', 'substrate_location']\n",
    "product_cols_wo_homologues = ['product_name', 'product_form', 'product_label',  'product_location']\n",
    "catalyst_cols_wo_homologues = ['catalyst_name', 'catalyst_form', 'catalyst_label', 'catalyst_location']\n",
    "\n",
    "# homologue_cols = [f\"_{x}_homologues\" for x in all_species]\n",
    "\n",
    "substrate_cols = [ f'substrate{x}' for x in ['_name', '_label', '_form', '_location']] #+#\\\n",
    "               # [f\"substrate{x}\" for x in homologue_cols]\n",
    "catalyst_cols = [ f'catalyst{x}' for x in ['_name', '_label', '_form', '_location']] #+\\\n",
    "                #[f\"catalyst{x}\" for x in homologue_cols] \n",
    "product_cols = [ f'product{x}' for x in ['_name', '_label', '_form', '_location']] #+\\\n",
    "               # [f\"product{x}\" for x in homologue_cols]\n",
    "\n",
    "reaction_standard_columns = ['AddedBy', 'Species', \n",
    "       'AdditionalInfo',  'external_links', 'trust_level',\n",
    "       'ModelV', 'ReactionEffect', 'reaction_type', 'Modifications', 'reaction_id']\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "# def read_dict(file):\n",
    "#     d = {}\n",
    "#     with open(file, \"r\") as f:\n",
    "#         for line in f:\n",
    "#             key, value = line.strip().split(\"\\t\")\n",
    "#             d[key] = value\n",
    "#     return d"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Add complexes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'SCF', 'WD/bHLH/MYB', 'ribosome'}"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "label = \"Complex\"\n",
    "q = '''MATCH (n:%s) RETURN DISTINCT n.name'''%label\n",
    "already_defined_complexes = set([d['n.name'] for d in graph.run(q).data()])\n",
    "already_defined_complexes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "91"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "complexes_to_add = set(pd.read_csv(parsed_path / \"complexes_to_add.tsv\", sep=\"\\t\", header=None)[0]) - set(already_defined_complexes)\n",
    "len(complexes_to_add)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "rows_w_new_complex = get_x_nodes(df_edges, complexes_to_add)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "want_cols = ['reaction_type', 'Modifications', 'Species']\n",
    "for prefix in ['input1', 'input2', 'input3', 'output1']:\n",
    "    want_cols += [f\"{prefix}_{x}\" for x in ['newID', 'location', 'label', 'form']]\n",
    "\n",
    "df_new_complex = df_edges.loc[rows_w_new_complex, want_cols]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "# first complexes defined by binding/oglimerisation reactions\n",
    "key = 'binding/oligomerisation'\n",
    "subdf = df_new_complex.loc[df_new_complex['reaction_type'] == key]\n",
    "\n",
    "binding_w_catalyst = subdf.loc[subdf['Modifications'] == 'with catalyst']\n",
    "binding_wo_catalyst = subdf.loc[subdf['Modifications'] != 'with catalyst']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [],
   "source": [
    "subdf_wo_catalyst = number_input_different(binding_wo_catalyst, homologues=False)\n",
    "subdf_w_catalyst = number_input_different(binding_w_catalyst, homologues=False, catalyst=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "subdf_wo_catalyst = subdf_wo_catalyst[['substrate_name', 'substrate_label', 'substrate_form', 'output1_newID', 'product_name']]\n",
    "subdf_w_catalyst = subdf_w_catalyst[['substrate_name', 'substrate_label', 'substrate_form', 'output1_newID', 'product_name']]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [],
   "source": [
    "new_subdf = pd.concat([subdf_wo_catalyst, subdf_w_catalyst])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [],
   "source": [
    "new_subdf.drop_duplicates('product_name', keep='first', inplace=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [],
   "source": [
    "new_subdf['substrate_label'] = new_subdf['substrate_label'].apply(lambda x: [z + \":FunctionalCluster\" if (z in helpers.plant_node_labels) else z  for z in x ])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>substrate_name</th>\n",
       "      <th>substrate_label</th>\n",
       "      <th>substrate_form</th>\n",
       "      <th>output1_newID</th>\n",
       "      <th>product_name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>[CTR[AT5G03730], ETR[AT1G04310,AT1G66340,AT2G4...</td>\n",
       "      <td>[PlantCoding:FunctionalCluster, PlantCoding:Fu...</td>\n",
       "      <td>[protein_active, protein_active]</td>\n",
       "      <td>CTR|ETR</td>\n",
       "      <td>CTR|ETR</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>[ET, ETR[AT1G04310,AT1G66340,AT2G40940,AT3G045...</td>\n",
       "      <td>[Metabolite, PlantCoding:FunctionalCluster]</td>\n",
       "      <td>[metabolite, protein_active]</td>\n",
       "      <td>ET|ETR</td>\n",
       "      <td>ET|ETR</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>[ETP[AT3G18910,AT3G18980], SCF]</td>\n",
       "      <td>[PlantCoding:FunctionalCluster, Complex]</td>\n",
       "      <td>[protein, complex]</td>\n",
       "      <td>ETP|SCF</td>\n",
       "      <td>ETP|SCF</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>[EBF[AT2G25490,AT5G25350], SCF]</td>\n",
       "      <td>[PlantCoding:FunctionalCluster, Complex]</td>\n",
       "      <td>[protein, complex]</td>\n",
       "      <td>EBF|SCF</td>\n",
       "      <td>EBF|SCF</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>[JAZ[AT1G17380,AT1G19180,AT1G30135,AT1G48500,A...</td>\n",
       "      <td>[PlantCoding:FunctionalCluster, PlantCoding:Fu...</td>\n",
       "      <td>[protein, protein_active]</td>\n",
       "      <td>EIN3(like)|JAZ</td>\n",
       "      <td>EIN3(like)|JAZ</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                       substrate_name  \\\n",
       "5   [CTR[AT5G03730], ETR[AT1G04310,AT1G66340,AT2G4...   \n",
       "7   [ET, ETR[AT1G04310,AT1G66340,AT2G40940,AT3G045...   \n",
       "10                    [ETP[AT3G18910,AT3G18980], SCF]   \n",
       "15                    [EBF[AT2G25490,AT5G25350], SCF]   \n",
       "17  [JAZ[AT1G17380,AT1G19180,AT1G30135,AT1G48500,A...   \n",
       "\n",
       "                                      substrate_label  \\\n",
       "5   [PlantCoding:FunctionalCluster, PlantCoding:Fu...   \n",
       "7         [Metabolite, PlantCoding:FunctionalCluster]   \n",
       "10           [PlantCoding:FunctionalCluster, Complex]   \n",
       "15           [PlantCoding:FunctionalCluster, Complex]   \n",
       "17  [PlantCoding:FunctionalCluster, PlantCoding:Fu...   \n",
       "\n",
       "                      substrate_form   output1_newID    product_name  \n",
       "5   [protein_active, protein_active]         CTR|ETR         CTR|ETR  \n",
       "7       [metabolite, protein_active]          ET|ETR          ET|ETR  \n",
       "10                [protein, complex]         ETP|SCF         ETP|SCF  \n",
       "15                [protein, complex]         EBF|SCF         EBF|SCF  \n",
       "17         [protein, protein_active]  EIN3(like)|JAZ  EIN3(like)|JAZ  "
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "new_subdf.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [],
   "source": [
    "binding_defined_complexes = set(new_subdf['product_name'].values)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "85"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(binding_defined_complexes)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{('ath', 'CAM|Ca2+'), ('ath', 'NPR1|PAD4|TGA2,5,6'), ('ath', 'EDS1|NPR1|TGA2,5,6'), ('ath', 'GSTU24|ROS'), ('ath/nbe', 'COI1|OMR1'), ('ath', 'EDS5|NPR1|TGA2,5,6')}\n"
     ]
    }
   ],
   "source": [
    "# other complexes\n",
    "other_complexes_set = set()\n",
    "for i , row in df_new_complex.iterrows():\n",
    "    for col_prefix in ['input1', 'input2', 'input3', 'output1']:\n",
    "        if row[col_prefix + \"_label\"] == 'Complex':\n",
    "            c = row[col_prefix + \"_newID\"]\n",
    "            if not ((c in binding_defined_complexes) or (c in already_defined_complexes)):\n",
    "                other_complexes_set.add((row['Species'], row[col_prefix + \"_newID\"]))\n",
    "print(other_complexes_set)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_subunits(x):\n",
    "    if '|' in x:\n",
    "        return x.split('|')\n",
    "    else:\n",
    "        return []"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_name_label(x):\n",
    "    ids_ = x['substrate_og_name']\n",
    "    species = x['species']\n",
    "    species = ','.join(species.split('/'))\n",
    "    names = []\n",
    "    labels = []\n",
    "    levels_ = ['node', 'clade', 'family']\n",
    "    for id_ in ids_:\n",
    "        functional_cluster = None\n",
    "        label = None\n",
    "        for level_ in levels_:\n",
    "            try: \n",
    "                functional_cluster = translate_functional_clusters.loc[(id_, level_, species)]['functional_cluster_name']\n",
    "                label = translate_functional_clusters.loc[(id_, level_, species)]['labels']\n",
    "                #print(id_, level_, functional_cluster, label)\n",
    "            except:\n",
    "                #print(id_, level_)\n",
    "                pass\n",
    "\n",
    "        #display(functional_cluster)\n",
    "        if functional_cluster:\n",
    "            label = \"FunctionalCluster:\" + label\n",
    "        else:\n",
    "            functional_cluster, label = node_id_to_node(id_)\n",
    "        if not functional_cluster:\n",
    "            print(\"ERROR: cannot identify correct subunit:\", id_, level_)\n",
    "\n",
    "            \n",
    "        names.append(functional_cluster)\n",
    "        labels.append(label)\n",
    "    return names, labels\n",
    "\n",
    "\n",
    "def clean_labels(labels):\n",
    "\tfor x in ['Family', 'Plant', 'Foreign', 'Node']:\n",
    "\t\tif x in labels:\n",
    "\t\t\tlabels.remove(x)\n",
    "\treturn labels[0]\n",
    "\n",
    "def node_id_to_node(id_):\n",
    "\n",
    "    query = '''MATCH (s) WHERE s.name=$x \n",
    "               RETURN s.name AS name, labels(s) AS labels'''\n",
    "    \n",
    "    cursor = graph.run(query, x=id_)\n",
    "    d = cursor.data()\n",
    "    \n",
    "    if len(d) == 0:\n",
    "        print(id_, d, \"no hit\")\n",
    "        return None, None\n",
    "    elif len(d) == 1:\n",
    "        label = clean_labels(d[0]['labels'])\n",
    "        name = d[0]['name']\n",
    "        return name, label\n",
    "    else:\n",
    "        print(id_, d, 'multiple hits') # should be impossible\n",
    "        return \"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>species</th>\n",
       "      <th>output1_newID</th>\n",
       "      <th>substrate_og_name</th>\n",
       "      <th>substrate_form</th>\n",
       "      <th>product_name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ath</td>\n",
       "      <td>CAM|Ca2+</td>\n",
       "      <td>[CAM, Ca2+]</td>\n",
       "      <td>[, ]</td>\n",
       "      <td>CAM|Ca2+</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ath</td>\n",
       "      <td>NPR1|PAD4|TGA2,5,6</td>\n",
       "      <td>[NPR1, PAD4, TGA2,5,6]</td>\n",
       "      <td>[, , ]</td>\n",
       "      <td>NPR1|PAD4|TGA2,5,6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ath</td>\n",
       "      <td>EDS1|NPR1|TGA2,5,6</td>\n",
       "      <td>[EDS1, NPR1, TGA2,5,6]</td>\n",
       "      <td>[, , ]</td>\n",
       "      <td>EDS1|NPR1|TGA2,5,6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ath</td>\n",
       "      <td>GSTU24|ROS</td>\n",
       "      <td>[GSTU24, ROS]</td>\n",
       "      <td>[, ]</td>\n",
       "      <td>GSTU24|ROS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ath/nbe</td>\n",
       "      <td>COI1|OMR1</td>\n",
       "      <td>[COI1, OMR1]</td>\n",
       "      <td>[, ]</td>\n",
       "      <td>COI1|OMR1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>ath</td>\n",
       "      <td>EDS5|NPR1|TGA2,5,6</td>\n",
       "      <td>[EDS5, NPR1, TGA2,5,6]</td>\n",
       "      <td>[, , ]</td>\n",
       "      <td>EDS5|NPR1|TGA2,5,6</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   species       output1_newID       substrate_og_name substrate_form  \\\n",
       "0      ath            CAM|Ca2+             [CAM, Ca2+]           [, ]   \n",
       "1      ath  NPR1|PAD4|TGA2,5,6  [NPR1, PAD4, TGA2,5,6]         [, , ]   \n",
       "2      ath  EDS1|NPR1|TGA2,5,6  [EDS1, NPR1, TGA2,5,6]         [, , ]   \n",
       "3      ath          GSTU24|ROS           [GSTU24, ROS]           [, ]   \n",
       "4  ath/nbe           COI1|OMR1            [COI1, OMR1]           [, ]   \n",
       "5      ath  EDS5|NPR1|TGA2,5,6  [EDS5, NPR1, TGA2,5,6]         [, , ]   \n",
       "\n",
       "         product_name  \n",
       "0            CAM|Ca2+  \n",
       "1  NPR1|PAD4|TGA2,5,6  \n",
       "2  EDS1|NPR1|TGA2,5,6  \n",
       "3          GSTU24|ROS  \n",
       "4           COI1|OMR1  \n",
       "5  EDS5|NPR1|TGA2,5,6  "
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "other_complexes = pd.DataFrame(other_complexes_set, columns=['species', 'output1_newID'])\n",
    "other_complexes['substrate_og_name'] = other_complexes['output1_newID'].apply(get_subunits)\n",
    "other_complexes['substrate_form'] = other_complexes['substrate_og_name'].apply(lambda x: [\"\" for c in x])\n",
    "other_complexes['product_name'] = other_complexes['output1_newID']\n",
    "other_complexes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>species</th>\n",
       "      <th>output1_newID</th>\n",
       "      <th>substrate_og_name</th>\n",
       "      <th>substrate_form</th>\n",
       "      <th>product_name</th>\n",
       "      <th>substrate_name</th>\n",
       "      <th>substrate_label</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ath</td>\n",
       "      <td>CAM|Ca2+</td>\n",
       "      <td>[CAM, Ca2+]</td>\n",
       "      <td>[, ]</td>\n",
       "      <td>CAM|Ca2+</td>\n",
       "      <td>[CAM[AT1G66410,AT3G01830,AT4G20780], Ca2+]</td>\n",
       "      <td>[FunctionalCluster:PlantCoding, Metabolite]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ath</td>\n",
       "      <td>NPR1|PAD4|TGA2,5,6</td>\n",
       "      <td>[NPR1, PAD4, TGA2,5,6]</td>\n",
       "      <td>[, , ]</td>\n",
       "      <td>NPR1|PAD4|TGA2,5,6</td>\n",
       "      <td>[NPR1[AT1G64280], PAD4[AT3G52430], TGA2,5,6[AT...</td>\n",
       "      <td>[FunctionalCluster:PlantCoding, FunctionalClus...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ath</td>\n",
       "      <td>EDS1|NPR1|TGA2,5,6</td>\n",
       "      <td>[EDS1, NPR1, TGA2,5,6]</td>\n",
       "      <td>[, , ]</td>\n",
       "      <td>EDS1|NPR1|TGA2,5,6</td>\n",
       "      <td>[EDS1[AT3G48090], NPR1[AT1G64280], TGA2,5,6[AT...</td>\n",
       "      <td>[FunctionalCluster:PlantCoding, FunctionalClus...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ath</td>\n",
       "      <td>GSTU24|ROS</td>\n",
       "      <td>[GSTU24, ROS]</td>\n",
       "      <td>[, ]</td>\n",
       "      <td>GSTU24|ROS</td>\n",
       "      <td>[GSTU24[AT1G17170], ROS]</td>\n",
       "      <td>[FunctionalCluster:PlantCoding, MetaboliteFamily]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ath/nbe</td>\n",
       "      <td>COI1|OMR1</td>\n",
       "      <td>[COI1, OMR1]</td>\n",
       "      <td>[, ]</td>\n",
       "      <td>COI1|OMR1</td>\n",
       "      <td>[COI1, OMR1[AT3G10050]]</td>\n",
       "      <td>[PlantCoding, FunctionalCluster:PlantCoding]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>ath</td>\n",
       "      <td>EDS5|NPR1|TGA2,5,6</td>\n",
       "      <td>[EDS5, NPR1, TGA2,5,6]</td>\n",
       "      <td>[, , ]</td>\n",
       "      <td>EDS5|NPR1|TGA2,5,6</td>\n",
       "      <td>[EDS5[AT4G39030], NPR1[AT1G64280], TGA2,5,6[AT...</td>\n",
       "      <td>[FunctionalCluster:PlantCoding, FunctionalClus...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   species       output1_newID       substrate_og_name substrate_form  \\\n",
       "0      ath            CAM|Ca2+             [CAM, Ca2+]           [, ]   \n",
       "1      ath  NPR1|PAD4|TGA2,5,6  [NPR1, PAD4, TGA2,5,6]         [, , ]   \n",
       "2      ath  EDS1|NPR1|TGA2,5,6  [EDS1, NPR1, TGA2,5,6]         [, , ]   \n",
       "3      ath          GSTU24|ROS           [GSTU24, ROS]           [, ]   \n",
       "4  ath/nbe           COI1|OMR1            [COI1, OMR1]           [, ]   \n",
       "5      ath  EDS5|NPR1|TGA2,5,6  [EDS5, NPR1, TGA2,5,6]         [, , ]   \n",
       "\n",
       "         product_name                                     substrate_name  \\\n",
       "0            CAM|Ca2+         [CAM[AT1G66410,AT3G01830,AT4G20780], Ca2+]   \n",
       "1  NPR1|PAD4|TGA2,5,6  [NPR1[AT1G64280], PAD4[AT3G52430], TGA2,5,6[AT...   \n",
       "2  EDS1|NPR1|TGA2,5,6  [EDS1[AT3G48090], NPR1[AT1G64280], TGA2,5,6[AT...   \n",
       "3          GSTU24|ROS                           [GSTU24[AT1G17170], ROS]   \n",
       "4           COI1|OMR1                            [COI1, OMR1[AT3G10050]]   \n",
       "5  EDS5|NPR1|TGA2,5,6  [EDS5[AT4G39030], NPR1[AT1G64280], TGA2,5,6[AT...   \n",
       "\n",
       "                                     substrate_label  \n",
       "0        [FunctionalCluster:PlantCoding, Metabolite]  \n",
       "1  [FunctionalCluster:PlantCoding, FunctionalClus...  \n",
       "2  [FunctionalCluster:PlantCoding, FunctionalClus...  \n",
       "3  [FunctionalCluster:PlantCoding, MetaboliteFamily]  \n",
       "4       [PlantCoding, FunctionalCluster:PlantCoding]  \n",
       "5  [FunctionalCluster:PlantCoding, FunctionalClus...  "
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "other_complexes[['substrate_name', 'substrate_label']] = other_complexes[['species', 'substrate_og_name']].apply(get_name_label, axis=1, result_type='expand')\n",
    "other_complexes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [],
   "source": [
    "del other_complexes['substrate_og_name']\n",
    "del other_complexes['species']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>output1_newID</th>\n",
       "      <th>product_name</th>\n",
       "      <th>substrate_form</th>\n",
       "      <th>substrate_label</th>\n",
       "      <th>substrate_name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>CAM|Ca2+</td>\n",
       "      <td>CAM|Ca2+</td>\n",
       "      <td>[, ]</td>\n",
       "      <td>[FunctionalCluster:PlantCoding, Metabolite]</td>\n",
       "      <td>[CAM[AT1G66410,AT3G01830,AT4G20780], Ca2+]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>NPR1|PAD4|TGA2,5,6</td>\n",
       "      <td>NPR1|PAD4|TGA2,5,6</td>\n",
       "      <td>[, , ]</td>\n",
       "      <td>[FunctionalCluster:PlantCoding, FunctionalClus...</td>\n",
       "      <td>[NPR1[AT1G64280], PAD4[AT3G52430], TGA2,5,6[AT...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>EDS1|NPR1|TGA2,5,6</td>\n",
       "      <td>EDS1|NPR1|TGA2,5,6</td>\n",
       "      <td>[, , ]</td>\n",
       "      <td>[FunctionalCluster:PlantCoding, FunctionalClus...</td>\n",
       "      <td>[EDS1[AT3G48090], NPR1[AT1G64280], TGA2,5,6[AT...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>GSTU24|ROS</td>\n",
       "      <td>GSTU24|ROS</td>\n",
       "      <td>[, ]</td>\n",
       "      <td>[FunctionalCluster:PlantCoding, MetaboliteFamily]</td>\n",
       "      <td>[GSTU24[AT1G17170], ROS]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>COI1|OMR1</td>\n",
       "      <td>COI1|OMR1</td>\n",
       "      <td>[, ]</td>\n",
       "      <td>[PlantCoding, FunctionalCluster:PlantCoding]</td>\n",
       "      <td>[COI1, OMR1[AT3G10050]]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        output1_newID        product_name substrate_form  \\\n",
       "0            CAM|Ca2+            CAM|Ca2+           [, ]   \n",
       "1  NPR1|PAD4|TGA2,5,6  NPR1|PAD4|TGA2,5,6         [, , ]   \n",
       "2  EDS1|NPR1|TGA2,5,6  EDS1|NPR1|TGA2,5,6         [, , ]   \n",
       "3          GSTU24|ROS          GSTU24|ROS           [, ]   \n",
       "4           COI1|OMR1           COI1|OMR1           [, ]   \n",
       "\n",
       "                                     substrate_label  \\\n",
       "0        [FunctionalCluster:PlantCoding, Metabolite]   \n",
       "1  [FunctionalCluster:PlantCoding, FunctionalClus...   \n",
       "2  [FunctionalCluster:PlantCoding, FunctionalClus...   \n",
       "3  [FunctionalCluster:PlantCoding, MetaboliteFamily]   \n",
       "4       [PlantCoding, FunctionalCluster:PlantCoding]   \n",
       "\n",
       "                                      substrate_name  \n",
       "0         [CAM[AT1G66410,AT3G01830,AT4G20780], Ca2+]  \n",
       "1  [NPR1[AT1G64280], PAD4[AT3G52430], TGA2,5,6[AT...  \n",
       "2  [EDS1[AT3G48090], NPR1[AT1G64280], TGA2,5,6[AT...  \n",
       "3                           [GSTU24[AT1G17170], ROS]  \n",
       "4                            [COI1, OMR1[AT3G10050]]  "
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "new_complexes = other_complexes.append(new_subdf, sort=True).reset_index(drop=True)\n",
    "new_complexes.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>substrate_name</th>\n",
       "      <th>substrate_label</th>\n",
       "      <th>substrate_form</th>\n",
       "      <th>output1_newID</th>\n",
       "      <th>product_name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>NPR1[AT1G64280]</td>\n",
       "      <td>FunctionalCluster:PlantCoding</td>\n",
       "      <td></td>\n",
       "      <td>NPR1|PAD4|TGA2,5,6</td>\n",
       "      <td>NPR1|PAD4|TGA2,5,6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>PAD4[AT3G52430]</td>\n",
       "      <td>FunctionalCluster:PlantCoding</td>\n",
       "      <td></td>\n",
       "      <td>NPR1|PAD4|TGA2,5,6</td>\n",
       "      <td>NPR1|PAD4|TGA2,5,6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>TGA2,5,6[AT3G12250,AT5G06950,AT5G06960]</td>\n",
       "      <td>FunctionalCluster:PlantCoding</td>\n",
       "      <td></td>\n",
       "      <td>NPR1|PAD4|TGA2,5,6</td>\n",
       "      <td>NPR1|PAD4|TGA2,5,6</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                            substrate_name                substrate_label  \\\n",
       "1                          NPR1[AT1G64280]  FunctionalCluster:PlantCoding   \n",
       "1                          PAD4[AT3G52430]  FunctionalCluster:PlantCoding   \n",
       "1  TGA2,5,6[AT3G12250,AT5G06950,AT5G06960]  FunctionalCluster:PlantCoding   \n",
       "\n",
       "  substrate_form       output1_newID        product_name  \n",
       "1                 NPR1|PAD4|TGA2,5,6  NPR1|PAD4|TGA2,5,6  \n",
       "1                 NPR1|PAD4|TGA2,5,6  NPR1|PAD4|TGA2,5,6  \n",
       "1                 NPR1|PAD4|TGA2,5,6  NPR1|PAD4|TGA2,5,6  "
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "exploded_new_subdf = helpers.unnesting(new_complexes, ['substrate_name', 'substrate_label', 'substrate_form']).drop_duplicates()\n",
    "exploded_new_subdf[exploded_new_subdf['product_name']=='NPR1|PAD4|TGA2,5,6']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [],
   "source": [
    "# save new complexes \n",
    "label = 'Complex'\n",
    "f = f'{label}-new-components.tsv'\n",
    "want_cols = 'product_name'\n",
    "new_complexes[want_cols].to_csv(f'../data/import/{f}', sep=\"\\t\", index=None, header=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "91\n"
     ]
    }
   ],
   "source": [
    "print(new_complexes.shape[0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "query = helpers.bioelement_node_query(f, \"Complex\", \n",
    "                           n_name=\"line.product_name\")\n",
    "#print(query)\n",
    "qr = graph.run(query)\n",
    "if not new_complexes.shape[0] == qr.stats()['nodes_created']:\n",
    "     raise Exception"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>substrate_name</th>\n",
       "      <th>substrate_label</th>\n",
       "      <th>substrate_form</th>\n",
       "      <th>output1_newID</th>\n",
       "      <th>product_name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>89</th>\n",
       "      <td>D14[AT3G03990]</td>\n",
       "      <td>PlantCoding:FunctionalCluster</td>\n",
       "      <td>protein_active</td>\n",
       "      <td>D14|MAX2|SCF</td>\n",
       "      <td>D14|MAX2|SCF</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>89</th>\n",
       "      <td>MAX2[AT2G42620]</td>\n",
       "      <td>PlantCoding:FunctionalCluster</td>\n",
       "      <td>protein_active</td>\n",
       "      <td>D14|MAX2|SCF</td>\n",
       "      <td>D14|MAX2|SCF</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>89</th>\n",
       "      <td>SCF</td>\n",
       "      <td>Complex</td>\n",
       "      <td>complex</td>\n",
       "      <td>D14|MAX2|SCF</td>\n",
       "      <td>D14|MAX2|SCF</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     substrate_name                substrate_label  substrate_form  \\\n",
       "89   D14[AT3G03990]  PlantCoding:FunctionalCluster  protein_active   \n",
       "89  MAX2[AT2G42620]  PlantCoding:FunctionalCluster  protein_active   \n",
       "89              SCF                        Complex         complex   \n",
       "\n",
       "   output1_newID  product_name  \n",
       "89  D14|MAX2|SCF  D14|MAX2|SCF  \n",
       "89  D14|MAX2|SCF  D14|MAX2|SCF  \n",
       "89  D14|MAX2|SCF  D14|MAX2|SCF  "
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "exploded_new_subdf[exploded_new_subdf['product_name']=='D14|MAX2|SCF']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>substrate_name</th>\n",
       "      <th>substrate_label</th>\n",
       "      <th>substrate_form</th>\n",
       "      <th>output1_newID</th>\n",
       "      <th>product_name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>88</th>\n",
       "      <td>BAK1[AT4G33430]</td>\n",
       "      <td>PlantCoding:FunctionalCluster</td>\n",
       "      <td>protein</td>\n",
       "      <td>BAK1|FLS2|flg22</td>\n",
       "      <td>BAK1|FLS2|flg22</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>89</th>\n",
       "      <td>D14[AT3G03990]</td>\n",
       "      <td>PlantCoding:FunctionalCluster</td>\n",
       "      <td>protein_active</td>\n",
       "      <td>D14|MAX2|SCF</td>\n",
       "      <td>D14|MAX2|SCF</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>89</th>\n",
       "      <td>MAX2[AT2G42620]</td>\n",
       "      <td>PlantCoding:FunctionalCluster</td>\n",
       "      <td>protein_active</td>\n",
       "      <td>D14|MAX2|SCF</td>\n",
       "      <td>D14|MAX2|SCF</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>89</th>\n",
       "      <td>SCF</td>\n",
       "      <td>Complex</td>\n",
       "      <td>complex</td>\n",
       "      <td>D14|MAX2|SCF</td>\n",
       "      <td>D14|MAX2|SCF</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>90</th>\n",
       "      <td>NPR1[AT1G64280]</td>\n",
       "      <td>PlantCoding:FunctionalCluster</td>\n",
       "      <td>protein</td>\n",
       "      <td>NPR1|NPR1</td>\n",
       "      <td>NPR1|NPR1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     substrate_name                substrate_label  substrate_form  \\\n",
       "88  BAK1[AT4G33430]  PlantCoding:FunctionalCluster         protein   \n",
       "89   D14[AT3G03990]  PlantCoding:FunctionalCluster  protein_active   \n",
       "89  MAX2[AT2G42620]  PlantCoding:FunctionalCluster  protein_active   \n",
       "89              SCF                        Complex         complex   \n",
       "90  NPR1[AT1G64280]  PlantCoding:FunctionalCluster         protein   \n",
       "\n",
       "      output1_newID     product_name  \n",
       "88  BAK1|FLS2|flg22  BAK1|FLS2|flg22  \n",
       "89     D14|MAX2|SCF     D14|MAX2|SCF  \n",
       "89     D14|MAX2|SCF     D14|MAX2|SCF  \n",
       "89     D14|MAX2|SCF     D14|MAX2|SCF  \n",
       "90        NPR1|NPR1        NPR1|NPR1  "
      ]
     },
     "execution_count": 42,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "exploded_new_subdf.tail()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Complex 16\n",
      "USING PERIODIC COMMIT 500\n",
      "           LOAD CSV WITH HEADERS FROM  'file:///COMPONENT_OF-Complex-Complex-edges.tsv' AS line FIELDTERMINATOR '\t'\n",
      "           \n",
      "           MATCH (source:Complex { name:line.substrate_name}),\n",
      "                 (target:Complex { name:line.product_name})\n",
      "           \n",
      "           CREATE (source)-[:COMPONENT_OF {\n",
      "                        added_by:line.AddedBy,\n",
      "                        additional_information: line.AdditionalInfo, \n",
      "                        model_version:line.ModelV,\n",
      "                        model_status:line.ModelStatus,\n",
      "                        \n",
      "                        pathway:line.Process\n",
      "                        }]->(target)\n",
      "Complex 16 16\n",
      "ForeignCoding 29\n",
      "USING PERIODIC COMMIT 500\n",
      "           LOAD CSV WITH HEADERS FROM  'file:///COMPONENT_OF-Complex-ForeignCoding-edges.tsv' AS line FIELDTERMINATOR '\t'\n",
      "           \n",
      "           MATCH (source:ForeignCoding { name:line.substrate_name}),\n",
      "                 (target:Complex { name:line.product_name})\n",
      "           \n",
      "           CREATE (source)-[:COMPONENT_OF {\n",
      "                        added_by:line.AddedBy,\n",
      "                        additional_information: line.AdditionalInfo, \n",
      "                        model_version:line.ModelV,\n",
      "                        model_status:line.ModelStatus,\n",
      "                        \n",
      "                        pathway:line.Process\n",
      "                        }]->(target)\n",
      "ForeignCoding 29 29\n",
      "ForeignEntity 2\n",
      "USING PERIODIC COMMIT 500\n",
      "           LOAD CSV WITH HEADERS FROM  'file:///COMPONENT_OF-Complex-ForeignEntity-edges.tsv' AS line FIELDTERMINATOR '\t'\n",
      "           \n",
      "           MATCH (source:ForeignEntity { name:line.substrate_name}),\n",
      "                 (target:Complex { name:line.product_name})\n",
      "           \n",
      "           CREATE (source)-[:COMPONENT_OF {\n",
      "                        added_by:line.AddedBy,\n",
      "                        additional_information: line.AdditionalInfo, \n",
      "                        model_version:line.ModelV,\n",
      "                        model_status:line.ModelStatus,\n",
      "                        \n",
      "                        pathway:line.Process\n",
      "                        }]->(target)\n",
      "ForeignEntity 2 2\n",
      "FunctionalCluster:PlantCoding 12\n",
      "USING PERIODIC COMMIT 500\n",
      "           LOAD CSV WITH HEADERS FROM  'file:///COMPONENT_OF-Complex-FunctionalCluster:PlantCoding-edges.tsv' AS line FIELDTERMINATOR '\t'\n",
      "           \n",
      "           MATCH (source:FunctionalCluster:PlantCoding { name:line.substrate_name}),\n",
      "                 (target:Complex { name:line.product_name})\n",
      "           \n",
      "           CREATE (source)-[:COMPONENT_OF {\n",
      "                        added_by:line.AddedBy,\n",
      "                        additional_information: line.AdditionalInfo, \n",
      "                        model_version:line.ModelV,\n",
      "                        model_status:line.ModelStatus,\n",
      "                        \n",
      "                        pathway:line.Process\n",
      "                        }]->(target)\n",
      "FunctionalCluster:PlantCoding 12 12\n",
      "Metabolite 10\n",
      "USING PERIODIC COMMIT 500\n",
      "           LOAD CSV WITH HEADERS FROM  'file:///COMPONENT_OF-Complex-Metabolite-edges.tsv' AS line FIELDTERMINATOR '\t'\n",
      "           \n",
      "           MATCH (source:Metabolite { name:line.substrate_name}),\n",
      "                 (target:Complex { name:line.product_name})\n",
      "           \n",
      "           CREATE (source)-[:COMPONENT_OF {\n",
      "                        added_by:line.AddedBy,\n",
      "                        additional_information: line.AdditionalInfo, \n",
      "                        model_version:line.ModelV,\n",
      "                        model_status:line.ModelStatus,\n",
      "                        \n",
      "                        pathway:line.Process\n",
      "                        }]->(target)\n",
      "Metabolite 10 10\n",
      "MetaboliteFamily 1\n",
      "USING PERIODIC COMMIT 500\n",
      "           LOAD CSV WITH HEADERS FROM  'file:///COMPONENT_OF-Complex-MetaboliteFamily-edges.tsv' AS line FIELDTERMINATOR '\t'\n",
      "           \n",
      "           MATCH (source:MetaboliteFamily { name:line.substrate_name}),\n",
      "                 (target:Complex { name:line.product_name})\n",
      "           \n",
      "           CREATE (source)-[:COMPONENT_OF {\n",
      "                        added_by:line.AddedBy,\n",
      "                        additional_information: line.AdditionalInfo, \n",
      "                        model_version:line.ModelV,\n",
      "                        model_status:line.ModelStatus,\n",
      "                        \n",
      "                        pathway:line.Process\n",
      "                        }]->(target)\n",
      "MetaboliteFamily 1 1\n",
      "PlantAbstract:FunctionalCluster 4\n",
      "USING PERIODIC COMMIT 500\n",
      "           LOAD CSV WITH HEADERS FROM  'file:///COMPONENT_OF-Complex-PlantAbstract:FunctionalCluster-edges.tsv' AS line FIELDTERMINATOR '\t'\n",
      "           \n",
      "           MATCH (source:PlantAbstract:FunctionalCluster { name:line.substrate_name}),\n",
      "                 (target:Complex { name:line.product_name})\n",
      "           \n",
      "           CREATE (source)-[:COMPONENT_OF {\n",
      "                        added_by:line.AddedBy,\n",
      "                        additional_information: line.AdditionalInfo, \n",
      "                        model_version:line.ModelV,\n",
      "                        model_status:line.ModelStatus,\n",
      "                        \n",
      "                        pathway:line.Process\n",
      "                        }]->(target)\n",
      "PlantAbstract:FunctionalCluster 4 4\n",
      "PlantCoding 1\n",
      "USING PERIODIC COMMIT 500\n",
      "           LOAD CSV WITH HEADERS FROM  'file:///COMPONENT_OF-Complex-PlantCoding-edges.tsv' AS line FIELDTERMINATOR '\t'\n",
      "           \n",
      "           MATCH (source:PlantCoding { name:line.substrate_name}),\n",
      "                 (target:Complex { name:line.product_name})\n",
      "           \n",
      "           CREATE (source)-[:COMPONENT_OF {\n",
      "                        added_by:line.AddedBy,\n",
      "                        additional_information: line.AdditionalInfo, \n",
      "                        model_version:line.ModelV,\n",
      "                        model_status:line.ModelStatus,\n",
      "                        \n",
      "                        pathway:line.Process\n",
      "                        }]->(target)\n",
      "PlantCoding 1 1\n",
      "PlantCoding:FunctionalCluster 112\n",
      "USING PERIODIC COMMIT 500\n",
      "           LOAD CSV WITH HEADERS FROM  'file:///COMPONENT_OF-Complex-PlantCoding:FunctionalCluster-edges.tsv' AS line FIELDTERMINATOR '\t'\n",
      "           \n",
      "           MATCH (source:PlantCoding:FunctionalCluster { name:line.substrate_name}),\n",
      "                 (target:Complex { name:line.product_name})\n",
      "           \n",
      "           CREATE (source)-[:COMPONENT_OF {\n",
      "                        added_by:line.AddedBy,\n",
      "                        additional_information: line.AdditionalInfo, \n",
      "                        model_version:line.ModelV,\n",
      "                        model_status:line.ModelStatus,\n",
      "                        \n",
      "                        pathway:line.Process\n",
      "                        }]->(target)\n",
      "PlantCoding:FunctionalCluster 112 112\n",
      "Process 2\n",
      "USING PERIODIC COMMIT 500\n",
      "           LOAD CSV WITH HEADERS FROM  'file:///COMPONENT_OF-Complex-Process-edges.tsv' AS line FIELDTERMINATOR '\t'\n",
      "           \n",
      "           MATCH (source:Process { name:line.substrate_name}),\n",
      "                 (target:Complex { name:line.product_name})\n",
      "           \n",
      "           CREATE (source)-[:COMPONENT_OF {\n",
      "                        added_by:line.AddedBy,\n",
      "                        additional_information: line.AdditionalInfo, \n",
      "                        model_version:line.ModelV,\n",
      "                        model_status:line.ModelStatus,\n",
      "                        \n",
      "                        pathway:line.Process\n",
      "                        }]->(target)\n",
      "Process 2 2\n"
     ]
    }
   ],
   "source": [
    "# component to complex edges\n",
    "edge_type = 'COMPONENT_OF'\n",
    "want_cols = ['substrate_name', 'substrate_form', 'substrate_label', 'product_name']\n",
    "\n",
    "for t, this_subdf in exploded_new_subdf.groupby(\"substrate_label\"):\n",
    "    f = f'{edge_type}-{label}-{t}-edges.tsv'  \n",
    "    print(t, this_subdf.shape[0])\n",
    "    this_subdf[want_cols].to_csv(f\"../data/import/{f}\", index=None, sep=\"\\t\")\n",
    "\n",
    "    query = helpers.make_create_type_of_edge_query(f, edge_type,\n",
    "                           source_label=t, target_label=\"Complex\",\n",
    "                           source_name=\"line.substrate_name\", target_name=\"line.product_name\",\n",
    "                           #source_form=\"line.substrate_form\"\n",
    "                          )\n",
    "    print(query)\n",
    "    qr = graph.run(query)\n",
    "    \n",
    "    r_created = qr.stats()['relationships_created']\n",
    "    print(t, this_subdf.shape[0], r_created)    \n",
    "    if not this_subdf.shape[0] == r_created:\n",
    "        print(\"\\tnot all edges created\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# END "
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
